/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   tokenizer_utils_checks.c                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: muiida <muiida@student.42tokyo.jp>         +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/05/14 12:00:00 by muiida            #+#    #+#             */
/*   Updated: 2025/05/14 05:41:22 by muiida           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../minishell.h"

/**
 * @brief 区切り文字かどうかをチェックします
 */
int	is_delimiter(char c)
{
	return (c == ' ' || c == '\t' || c == '\n');
}

/**
 * @brief 引用符かどうかをチェックします
 */
int	is_quote(char c)
{
	return (c == '\'' || c == '\"');
}

/**
 * @brief メタ文字かどうかをチェックします
 */
int	is_meta(char c)
{
	return (c == '|' || c == '<' || c == '>');
}
